using System;

namespace Lab_4
{
    internal class Program
    {
        /*
         * Рядки:
         *      значення рядка (символи),
                конструктор за умовчанням,
                конструктор з параметрами,
                конструктор копіювання,
                метод обчислення довжини рядка, 
                методи отримання даних рядка,
                перевантаження операторів
                    додавання, 
                    множення
         *Описати клас, три об'єкти CB1, CB2, CB3, використовуючи різні конструктори;
         * "збільшити" у 2 рази об’єкт CB3 подвоєнням кожного символу;
         * "скласти" об'єкти CB2, CB3 і результат "помістити" до об’єкта CB1;
         *  результат дій вивести на екран
         */
        public static void Main(string[] args)
        {
            CB CB1 = new CB { _text = "Привiт" };
            CB CB2 = new CB(", Україна ");
            CB CB3 = new CB("!");
            CB3 = CB3 * 3;
            CB1 = CB1 + CB2 + CB3;
            Console.WriteLine(CB1);
        }
    }
}